ogneyar/C_Study/MDR_c/MDR32F02FI/Examples/Examples Eclipse/OTP/MLDR187.svd
        <register>
          <name>CH4_DTG</name>
          <displayName>CH4_DTG</displayName>
          <description>CH4_DTG description</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DTG</name>
              <description>DTG description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EDTS</name>
              <description>EDTS description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTGX</name>
              <description>DTGX description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BRKETR_CNTRL</name>
          <displayName>BRKETR_CNTRL</displayName>
          <description>BRKETR_CNTRL description</description>
          <addressOffset>0x00000050</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BRK_INV</name>
              <description>BRK_INV description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETR_INV</name>
              <description>ETR_INV description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRPSC</name>
              <description>ETRPSC description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ETR_FILTER</name>
              <description>ETR_FILTER description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <displayName>STATUS</displayName>
          <description>STATUS description</description>
          <addressOffset>0x00000054</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CNTZEROEVENT</name>
              <description>CNTZEROEVENT description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNTARREVENT</name>
              <description>CNTARREVENT description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRREEVENT</name>
              <description>ETRREEVENT description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRFEEVENT</name>
              <description>ETRFEEVENT description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRKEVENT</name>
              <description>BRKEVENT description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCRCAPEVENT</name>
              <description>CCRCAPEVENT description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCRREFEVENT</name>
              <description>CCRREFEVENT description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCRCAP1EVENT</name>
              <description>CCRCAP1EVENT description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <displayName>IE</displayName>
          <description>IE description</description>
          <addressOffset>0x00000058</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CNTZEROEVENTIE</name>
              <description>CNTZEROEVENTIE description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNTARREVENTIE</name>
              <description>CNTARREVENTIE description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRREEVENTIE</name>
              <description>ETRREEVENTIE description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRFEEVENTIE</name>
              <description>ETRFEEVENTIE description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRKEVENTIE</name>
              <description>BRKEVENTIE description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCRCAPEVENTIE</name>
              <description>CCRCAPEVENTIE description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCRREFEVENTIE</name>
              <description>CCRREFEVENTIE description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCRCAP1EVENTIE</name>
              <description>CCRCAP1EVENTIE description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RE</name>
          <displayName>DMA_RE</displayName>
          <description>DMA_RE description</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CNTZEROEVENTRE</name>
              <description>CNTZEROEVENTRE description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNTARREVENTRE</name>
              <description>CNTARREVENTRE description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRREEVENTRE</name>
              <description>ETRREEVENTRE description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETRFEEVENTRE</name>
              <description>ETRFEEVENTRE description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRKEVENTRE</name>
              <description>BRKEVENTRE description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCRCAPEVENTRE</name>
              <description>CCRCAPEVENTRE description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCRREFEVENTRE</name>
              <description>CCRREFEVENTRE description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCRCAP1EVENTRE</name>
              <description>CCRCAP1EVENTRE description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1_CNTRL2</name>
          <displayName>CH1_CNTRL2</displayName>
          <description>CH1_CNTRL2 description</description>
          <addressOffset>0x00000060</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHSEL1</name>
              <description>CHSEL1 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CCR1_EN</name>
              <description>CCR1_EN description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRRRLD</name>
              <description>CRRRLD description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIX</name>
              <description>FIX description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_CNTRL2</name>
          <displayName>CH2_CNTRL2</displayName>
          <description>CH2_CNTRL2 description</description>
          <addressOffset>0x00000064</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHSEL1</name>
              <description>CHSEL1 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CCR1_EN</name>
              <description>CCR1_EN description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRRRLD</name>
              <description>CRRRLD description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIX</name>
              <description>FIX description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_CNTRL2</name>
          <displayName>CH3_CNTRL2</displayName>
          <description>CH3_CNTRL2 description</description>
          <addressOffset>0x00000068</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHSEL1</name>
              <description>CHSEL1 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CCR1_EN</name>
              <description>CCR1_EN description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRRRLD</name>
              <description>CRRRLD description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIX</name>
              <description>FIX description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_CNTRL2</name>
          <displayName>CH4_CNTRL2</displayName>
          <description>CH4_CNTRL2 description</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHSEL1</name>
              <description>CHSEL1 description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CCR1_EN</name>
              <description>CCR1_EN description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRRRLD</name>
              <description>CRRRLD description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FIX</name>
              <description>FIX description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR11</name>
          <displayName>CCR11</displayName>
          <description>CCR11 description</description>
          <addressOffset>0x00000070</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>CCR21</name>
          <displayName>CCR21</displayName>
          <description>CCR21 description</description>
          <addressOffset>0x00000074</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>CCR31</name>
          <displayName>CCR31</displayName>
          <description>CCR31 description</description>
          <addressOffset>0x00000078</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>CCR41</name>
          <displayName>CCR41</displayName>
          <description>CCR41 description</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>DMA_RECH1</name>
          <displayName>DMA_RECH1</displayName>
          <description>DMA_RECH1 description</description>
          <addressOffset>0x00000080</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>DMA_RECH2</name>
          <displayName>DMA_RECH2</displayName>
          <description>DMA_RECH2 description</description>
          <addressOffset>0x00000084</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>DMA_RECH3</name>
          <displayName>DMA_RECH3</displayName>
          <description>DMA_RECH3 description</description>
          <addressOffset>0x00000088</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>DMA_RECH4</name>
          <displayName>DMA_RECH4</displayName>
          <description>DMA_RECH4 description</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
