ogneyar/C_Study/MDR_c/MDR32F02FI/Examples/Examples Eclipse/OTP/MLDR187.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TIMER3</name>
      <description>TIMER3 description</description>
      <groupName>TIMER3</groupName>
      <baseAddress>0x400D8000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CNT</name>
          <displayName>CNT</displayName>
          <description>CNT description</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>PSG</name>
          <displayName>PSG</displayName>
          <description>PSG description</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSG</name>
              <description>PSG description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <displayName>ARR</displayName>
          <description>ARR description</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>CNTRL</name>
          <displayName>CNTRL</displayName>
          <description>CNTRL description</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CNT_EN</name>
              <description>CNT_EN description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ARRB_EN</name>
              <description>ARRB_EN description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_CMPL</name>
              <description>WR_CMPL description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>DIR description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDTS</name>
              <description>FDTS description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>CNT_MODE description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EVENT_SEL</name>
              <description>EVENT_SEL description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <displayName>CCR1</displayName>
          <description>CCR1 description</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>CCR2</name>
          <displayName>CCR2</displayName>
          <description>CCR2 description</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>CCR3</name>
          <displayName>CCR3</displayName>
          <description>CCR3 description</description>
          <addressOffset>0x00000018</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>CCR4</name>
          <displayName>CCR4</displayName>
          <description>CCR4 description</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>CH1_CNTRL</name>
          <displayName>CH1_CNTRL</displayName>
          <description>CH1_CNTRL description</description>
          <addressOffset>0x00000020</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHFLTR</name>
              <description>CHFLTR description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CHSEL</name>
              <description>CHSEL description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CHPSC</name>
              <description>CHPSC description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OCCE</name>
              <description>OCCE description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCCM</name>
              <description>OCCM description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>BRKEN</name>
              <description>BRKEN description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETREN</name>
              <description>ETREN description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_CMPL</name>
              <description>WR_CMPL description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAP_NPWM</name>
              <description>CAP_NPWM description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_CNTRL</name>
          <displayName>CH2_CNTRL</displayName>
          <description>CH2_CNTRL description</description>
          <addressOffset>0x00000024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHFLTR</name>
              <description>CHFLTR description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CHSEL</name>
              <description>CHSEL description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CHPSC</name>
              <description>CHPSC description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OCCE</name>
              <description>OCCE description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCCM</name>
              <description>OCCM description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>BRKEN</name>
              <description>BRKEN description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETREN</name>
              <description>ETREN description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_CMPL</name>
              <description>WR_CMPL description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAP_NPWM</name>
              <description>CAP_NPWM description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_CNTRL</name>
          <displayName>CH3_CNTRL</displayName>
          <description>CH3_CNTRL description</description>
          <addressOffset>0x00000028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHFLTR</name>
              <description>CHFLTR description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CHSEL</name>
              <description>CHSEL description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CHPSC</name>
              <description>CHPSC description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OCCE</name>
              <description>OCCE description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCCM</name>
              <description>OCCM description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>BRKEN</name>
              <description>BRKEN description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETREN</name>
              <description>ETREN description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_CMPL</name>
              <description>WR_CMPL description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAP_NPWM</name>
              <description>CAP_NPWM description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_CNTRL</name>
          <displayName>CH4_CNTRL</displayName>
          <description>CH4_CNTRL description</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHFLTR</name>
              <description>CHFLTR description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CHSEL</name>
              <description>CHSEL description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CHPSC</name>
              <description>CHPSC description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OCCE</name>
              <description>OCCE description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCCM</name>
              <description>OCCM description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>BRKEN</name>
              <description>BRKEN description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETREN</name>
              <description>ETREN description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR_CMPL</name>
              <description>WR_CMPL description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAP_NPWM</name>
              <description>CAP_NPWM description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1_CNTRL1</name>
          <displayName>CH1_CNTRL1</displayName>
          <description>CH1_CNTRL1 description</description>
          <addressOffset>0x00000030</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SELOE</name>
              <description>SELOE description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SELO</name>
              <description>SELO description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INV</name>
              <description>INV description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NSELOE</name>
              <description>NSELOE description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NSELO</name>
              <description>NSELO description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NINV</name>
              <description>NINV description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_CNTRL1</name>
          <displayName>CH2_CNTRL1</displayName>
          <description>CH2_CNTRL1 description</description>
          <addressOffset>0x00000034</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SELOE</name>
              <description>SELOE description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SELO</name>
              <description>SELO description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INV</name>
              <description>INV description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NSELOE</name>
              <description>NSELOE description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NSELO</name>
              <description>NSELO description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NINV</name>
              <description>NINV description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_CNTRL1</name>
          <displayName>CH3_CNTRL1</displayName>
          <description>CH3_CNTRL1 description</description>
          <addressOffset>0x00000038</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SELOE</name>
              <description>SELOE description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SELO</name>
              <description>SELO description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INV</name>
              <description>INV description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NSELOE</name>
              <description>NSELOE description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NSELO</name>
              <description>NSELO description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NINV</name>
              <description>NINV description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_CNTRL1</name>
          <displayName>CH4_CNTRL1</displayName>
          <description>CH4_CNTRL1 description</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SELOE</name>
              <description>SELOE description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SELO</name>
              <description>SELO description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INV</name>
              <description>INV description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NSELOE</name>
              <description>NSELOE description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NSELO</name>
              <description>NSELO description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NINV</name>
              <description>NINV description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1_DTG</name>
          <displayName>CH1_DTG</displayName>
          <description>CH1_DTG description</description>
          <addressOffset>0x00000040</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DTG</name>
              <description>DTG description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EDTS</name>
              <description>EDTS description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTGX</name>
              <description>DTGX description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2_DTG</name>
          <displayName>CH2_DTG</displayName>
          <description>CH2_DTG description</description>
          <addressOffset>0x00000044</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DTG</name>
              <description>DTG description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EDTS</name>
              <description>EDTS description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTGX</name>
              <description>DTGX description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3_DTG</name>
          <displayName>CH3_DTG</displayName>
          <description>CH3_DTG description</description>
          <addressOffset>0x00000048</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DTG</name>
              <description>DTG description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EDTS</name>
              <description>EDTS description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTGX</name>
              <description>DTGX description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
