ogneyar/C_Study/MDR_c/MDR32F02FI/Examples/Examples Eclipse/OTP/MLDR187.svd
        <register>
          <name>F2WATTN_L</name>
          <displayName>F2WATTN_L</displayName>
          <description>F2WATTN_L description</description>
          <addressOffset>0x00000154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F2WATTHRN_L</name>
              <description>F2WATTHRN_L description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F2VARP_L</name>
          <displayName>F2VARP_L</displayName>
          <description>F2VARP_L description</description>
          <addressOffset>0x00000158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F2VARHRP_L</name>
              <description>F2VARHRP_L description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F2VARN_L</name>
          <displayName>F2VARN_L</displayName>
          <description>F2VARN_L description</description>
          <addressOffset>0x0000015C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F2VARHRN_L</name>
              <description>F2VARHRN_L description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>F2VR_L</name>
          <displayName>F2VR_L</displayName>
          <description>F2VR_L description</description>
          <addressOffset>0x00000160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>F2VAHR_L</name>
              <description>F2VAHR_L description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OTP</name>
      <description>OTP description</description>
      <groupName>OTP</groupName>
      <baseAddress>0x70000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STAT_CTRL</name>
          <displayName>STAT_CTRL</displayName>
          <description>Status and control register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FSM_STATE</name>
              <description>Sostojanie konechnogo avtomata obszego kontrollera modulja</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>OTP vypolnjaet kakie-libo dejstvija i ne gotovo prinjat' ocherednoj zapros na chtenie ili zapis'</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTP_LOCK</name>
              <description>Signal blokirovki OTP ot zapisi, edinica v dannom signali oznachaet chto vse banki modulja blokirovany</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTP_PLOCK</name>
              <description>Signal chastichnoj blokirovki OTP ot zapisi, edinica v dannom signali oznachaet chto nekotorye banki modulja blokirovany</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RW_ERROR</name>
              <description>Oshibka chtenija ili zapisi</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEST_CRC</name>
              <description>Sostojanie signala celostnosti dannyh special'nyh testovyh opcij</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE_PCRC</name>
              <description>Sostojanie signala celostnosti dannyh registra zaszity ot zapisi</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>READ_PCRC</name>
              <description>Sostojanie signala celostnosti dannyh registra zaszity ot chtenija</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR_EN</name>
              <description>Zapros rezhima prjamogo upravlenija</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR_ACK</name>
              <description>Podtverzhdenie vkljuchenija rezhima prjamogo upravlenija</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR_ERR</name>
              <description>Oshibka vkljuchenija rezhima prjamogo upravlenija</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <displayName>STAT</displayName>
          <description>Blocks status register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OTP_0_FSM_STATE</name>
              <description>Sostojanie konechnogo avtomata bloka OTP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OTP_0_LOCK</name>
              <description>Sostojanie blokirovki zapisi modulja OTP 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTP_0_BUSY</name>
              <description>Modul' OTP 0 vypolnjaet kakie-libo dejstvija i ne gotovo prinjat' ocherednoj zapros na chtenie ili zapis'</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DELAY_0</name>
          <displayName>DELAY_0</displayName>
          <description>Delay 0 register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DELAY_20NS</name>
              <description>Velichina zaderzhki zadaetsja v taktah osnovnoj chastoty raboty modulja, pauza ravna N+1 taktu, gde N zadannoe v pole chislo. I dolzhna byt' ne men'she 20ns.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DELAY_70NS</name>
              <description>pri chtenii dannyh iz OTP po shine AHB. Velichina zaderzhki zadaetsja v taktah osnovnoj chastoty raboty modulja, pauza ravna N+1 taktu, gde N zadannoe v pole chislo. I dolzhna byt' ne men'she 70ns.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DELAY_50NS</name>
              <description>Velichina zaderzhki zadaetsja v taktah osnovnoj chastoty raboty modulja, pauza ravna N+1 taktu, gde N zadannoe v pole chislo. I dolzhna byt' ne men'she 50ns.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DELAY_01US</name>
              <description>Velichina zaderzhki zadaetsja v taktah osnovnoj chastoty raboty modulja, pauza ravna N+1 taktu, gde N zadannoe v pole chislo. I dolzhna byt' ne men'she 1mks ine bolee 2mks.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DELAY_1</name>
          <displayName>DELAY_1</displayName>
          <description>Delay 1 register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DELAY_16US</name>
              <description>Velichina zaderzhki zadaetsja v taktah osnovnoj chastoty raboty modulja, pauza ravna N+1 taktu, gde N zadannoe v pole chislo. I dolzhna byt' ne men'she 16mks ine bol'she 17mks.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RW_CMD</name>
          <displayName>RW_CMD</displayName>
          <description>Read/write command register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Bitovyj adres zapisi i chtenija. Zapis' proizvodit'sja bitami, chtenie proizvodit'sja bajtami, pri chtenii mladshie 3 bita ignorirujutsja i schitajutsja ravnymi 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
            </field>
            <field>
              <name>DATA_0</name>
              <description>Dannye dlja zapisi v OTP 0 -ne proizvodit' zapis'.Nachal'noe sostojanie OTP - 0, zapisat' mozhno tol'ko 1, steret' 1 uzhe nel'zja</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>READ</name>
              <description>Komanda na chtenie iz ukazannogo adresa, pri nalichii 1 v dannom pole i 0 v pole komandy zapisi proizvodit'sja procedura chtenija.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRITE</name>
              <description>Komanda na zapis' v ukazannyj adres, pri nalichii 1 v dannom pole i 0 v pole komandy chtenija proizvodit'sja procedura zapisi.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RW_ERROR</name>
              <description>Oshibka vypolnenija poslednej operacii chtenija ili zapisi Oshibka voznikaet pri popytke chtenija ili zapisi vo vremja ustanovlennogo signala BUSY</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>READ_DATA</name>
          <displayName>READ_DATA</displayName>
          <description>Read data register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA_0</name>
              <description>Dannye schitannye iz 0 banka OTP v sluchae uspeshnogo zavershenija procedury chtenija, pri oshibkah v pole zanosit'sja konstanta 0xEF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITE_PROTECT</name>
          <displayName>WRITE_PROTECT</displayName>
          <description>Write protection register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WRITE_PROTECT</name>
              <description></description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>READ_PROTECT</name>
          <displayName>READ_PROTECT</displayName>
          <description>Read protection register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>READ_PROTECT</name>
              <description></description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR_CTRL</name>
          <displayName>DIR_CTRL</displayName>
          <description>Direct control register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WEB</name>
              <description></description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTB</name>
              <description></description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>READEN</name>
              <description></description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGMEN</name>
              <description></description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DLE</name>
              <description></description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIN_0</name>
              <description></description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPUMPEN</name>
              <description></description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLE</name>
              <description></description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEB</name>
              <description></description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A</name>
              <description></description>
              <bitOffset>9</bitOffset>
              <bitWidth>17</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR_DATA</name>
          <displayName>DIR_DATA</displayName>
          <description>Direct control data register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>D_0</name>
              <description>V rezhime prjamogo upravlenija soderzhit prochitannye dannye iz bloka OTP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST_OPT</name>
          <displayName>TEST_OPT</displayName>
          <description>Test options register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
