ogneyar/C_Study/MDR_c/MDR32F02FI/Examples/Examples Eclipse/OTP/MLDR187.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PBYTE</name>
      <description>PBYTE description</description>
      <groupName>PBYTE</groupName>
      <baseAddress>0x60028000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TRM_00</name>
          <displayName>TRM_00</displayName>
          <description>Transformation register 0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_01</name>
          <displayName>TRM_01</displayName>
          <description>Transformation register 1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_02</name>
          <displayName>TRM_02</displayName>
          <description>Transformation register 2</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_03</name>
          <displayName>TRM_03</displayName>
          <description>Transformation register 3</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_04</name>
          <displayName>TRM_04</displayName>
          <description>Transformation register 4</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_05</name>
          <displayName>TRM_05</displayName>
          <description>Transformation register 5</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_06</name>
          <displayName>TRM_06</displayName>
          <description>Transformation register 6</description>
          <addressOffset>0x00000018</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_07</name>
          <displayName>TRM_07</displayName>
          <description>Transformation register 7</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_08</name>
          <displayName>TRM_08</displayName>
          <description>Transformation register 8</description>
          <addressOffset>0x00000020</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_09</name>
          <displayName>TRM_09</displayName>
          <description>Transformation register 9</description>
          <addressOffset>0x00000024</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_10</name>
          <displayName>TRM_10</displayName>
          <description>Transformation register 10</description>
          <addressOffset>0x00000028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_11</name>
          <displayName>TRM_11</displayName>
          <description>Transformation register 11</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_12</name>
          <displayName>TRM_12</displayName>
          <description>Transformation register 12</description>
          <addressOffset>0x00000030</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_13</name>
          <displayName>TRM_13</displayName>
          <description>Transformation register 13</description>
          <addressOffset>0x00000034</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_14</name>
          <displayName>TRM_14</displayName>
          <description>Transformation register 14</description>
          <addressOffset>0x00000038</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRM_15</name>
          <displayName>TRM_15</displayName>
          <description>Transformation register 15</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>MUX_SET</name>
          <displayName>MUX_SET</displayName>
          <description>Transformation setup register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IN_SEL</name>
              <description>IN_SEL description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_SEL</name>
              <description>OUT_SEL description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_VAL</name>
          <displayName>MUX_VAL</displayName>
          <description>Transformation value register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>VAL description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEL</name>
              <description>SEL description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
