ogneyar/C_Study/MDR_c/MDR32F02FI/Examples/Examples Eclipse/OTP/MLDR187.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>P_BIT2</name>
      <description>P_BIT2 description</description>
      <groupName>P_BIT2</groupName>
      <baseAddress>0x60034000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TRANSFORM_0</name>
          <displayName>TRANSFORM_0</displayName>
          <description>Transformation register 0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRANSFORM_1</name>
          <displayName>TRANSFORM_1</displayName>
          <description>Transformation register 0</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRANSFORM_2</name>
          <displayName>TRANSFORM_2</displayName>
          <description>Transformation register 0</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRANSFORM_3</name>
          <displayName>TRANSFORM_3</displayName>
          <description>Transformation register 0</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>MUX_SET</name>
          <displayName>MUX_SET</displayName>
          <description>Transformation setup register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IN_SEL</name>
              <description>Zapis' zadaet perestanovku IN_SEL -&gt; OUT_SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_SEL</name>
              <description>Zapis' zadaet perestanovku IN_SEL -&gt; OUT_SEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_VAL</name>
          <displayName>MUX_VAL</displayName>
          <description>Transformation value register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>Pri chtenii iz dannogo polja vozvraszaetsja znachenie perestanovki dlja vybrannogo cherez SEL vyhodnogo bita.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEL</name>
              <description>Zapis' v dannoe pole zadaet vyhodnoj bit, dlja kotorogo bude vozvraszeno znachenie perestanovki pri chtenii registra.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>P_BIT3</name>
      <description>P_BIT3 description</description>
      <groupName>P_BIT3</groupName>
      <baseAddress>0x60038000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TRANSFORM_0</name>
          <displayName>TRANSFORM_0</displayName>
          <description>Transformation register 0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRANSFORM_1</name>
          <displayName>TRANSFORM_1</displayName>
          <description>Transformation register 0</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRANSFORM_2</name>
          <displayName>TRANSFORM_2</displayName>
          <description>Transformation register 0</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>TRANSFORM_3</name>
          <displayName>TRANSFORM_3</displayName>
          <description>Transformation register 0</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields/>
        </register>
        <register>
          <name>MUX_SET</name>
          <displayName>MUX_SET</displayName>
          <description>Transformation setup register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IN_SEL</name>
              <description>Zapis' zadaet perestanovku IN_SEL -&gt; OUT_SEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUT_SEL</name>
              <description>Zapis' zadaet perestanovku IN_SEL -&gt; OUT_SEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_VAL</name>
          <displayName>MUX_VAL</displayName>
          <description>Transformation value register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VAL</name>
              <description>Pri chtenii iz dannogo polja vozvraszaetsja znachenie perestanovki dlja vybrannogo cherez SEL vyhodnogo bita.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEL</name>
              <description>Zapis' v dannoe pole zadaet vyhodnoj bit, dlja kotorogo bude vozvraszeno znachenie perestanovki pri chtenii registra.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
